/**********************************************************************************************************************
* Данный модуль содержит описания собственных структур
**********************************************************************************************************************/

#pragma ones


/*********************************************************************************************************************
* Объявление констант
*********************************************************************************************************************/

const int START_ROW = 15;  // Номер строки для начала ввода/вывода данных таблицы
const int START_COL = 7;   // Позиция курсора для начала ввода/вывода данных таблицы
const int STEP_COL = 17;  // Шаг для перемещения позиции курсора при выводе таблицы
const int STEP_ROW = 3;   // Шаг для перемещения по строкам курсора при выводе таблицы
const int MAX_CHARS = 80;  // Максимальное количество символов для элементов структуры типа char[]

/*********************************************************************************************************************
* Макроопределения ESC-последовательностей
*********************************************************************************************************************/
#define ESC                     "\x1B" // начало выражения

/* переместить курсор в строку row и позицию col */
#define move_cursor(row, col)   std::cout << ESC "[" << (row) << ";" << (col) << "H"

/*********************************************************************************************************************/

struct PC {
    /*****************************************************************************************************************
    * Назначение: Описание характеристик ПК
    * Исходные данные:
    * Вызываемые модули: "definitions.h"
    * Описание структуры:
    * Структура содержит 6 элементов и 2 метода(функции).
    * Элементы:
    *   1) number   - порядковый номер ПК
    *   2) cpu_type - тип процессора
    *   3) cpu_freq - тактовая частота процессора
    *   4) memory   - объем оперативной памяти
    *   5) storage  - объем дискового накопителя
    *   6) display  - тип дисплея
    * Методы(функции):
    *   1) set      - инициализация элементов структуры значениями, считанными из потока STDIN с перемещением
    * курсора во время ввода в соответствующие ячейки таблицы.
    *   2) print      - вывод элементов структуры с перемещением курсора во время вывода в соответствующие ячейки таблицы.
    * Дата: 15 / 05 / 2022 Версия 1.01
    * Автор: Студент НГТУ ИРИТ, Халеев А. А. гр. 21-ИВТз
    * Исправления: нет
    *****************************************************************************************************************/

    int number;
    char cpu_type[MAX_CHARS];
    char cpu_freq[MAX_CHARS];
    char memory[MAX_CHARS];
    char storage[MAX_CHARS];
    char display[MAX_CHARS];

    void set(int row_number, int row_to_print);

    void print(int row_to_print);
};

